# Pandas 

- It is python library used in data science and machine learning.
- used for manipulation and data visualization . 
- It is built on top of two main libraries numpy for mathematical operatioins and matplotlib for data visualization
- It reduces time as well as code length as compaired to numpy and matplotlib.

In [1]:
# install
!pip install pandas

Requirement already satisfied: pandas in c:\users\mayur\anaconda3\lib\site-packages (1.1.3)
Requirement already satisfied: pytz>=2017.2 in c:\users\mayur\anaconda3\lib\site-packages (from pandas) (2020.1)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\mayur\anaconda3\lib\site-packages (from pandas) (2.8.1)
Requirement already satisfied: numpy>=1.15.4 in c:\users\mayur\anaconda3\lib\site-packages (from pandas) (1.19.2)
Requirement already satisfied: six>=1.5 in c:\users\mayur\anaconda3\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [1]:
# importing pandas library
import pandas as pd

## Data structures

### 1) Pandas series 

#### It is one-dimemsionl labeled array i.e single column of exel sheet or Pandas DataFrame of any data type such as integer , strings ,  float , python object , etc.

In [3]:
# we can create series by using python list or numpy array 

# pandas.Series(data=None, index=None, dtype=None, name=None, copy=False, fastpath=False)

In [4]:
# using list of names 
lst = ['Prashant','Adesh','Ramesh','Kiran']
names = pd.Series(lst)
names

0    Prashant
1       Adesh
2      Ramesh
3       Kiran
dtype: object

In [5]:
type(names)

pandas.core.series.Series

In [6]:
# using list of numbers
ages = pd.Series([20,19,18,23])
ages

0    20
1    19
2    18
3    23
dtype: int64

In [7]:
# accessing element by index
ages[2]

18

In [8]:
# selecting particular data from series by indexing using .loc[] operator
ages.loc[0:2]

0    20
1    19
2    18
dtype: int64

In [9]:
# selecting particular data from series by indexing using .iloc[] operator
ages.iloc[0:2]

0    20
1    19
dtype: int64

In [10]:
# conversion of numpy array into pandas dataframe
import numpy as np
arr = np.array([60,70,80,90])

marks = pd.Series(arr)
marks

0    60
1    70
2    80
3    90
dtype: int32

In [11]:
type(marks)

pandas.core.series.Series

In [12]:
# we can perform binary operations like addition , substraction , multiplication , division of two serieses having same length
# addition of tow series

# ages + marks --> numpy

ages.add(marks) # --> pandas

0     80
1     89
2     98
3    113
dtype: int64

In [13]:
ages.sub(marks)

0   -40
1   -51
2   -62
3   -67
dtype: int64

In [14]:
ages.mul(marks)

0    1200
1    1330
2    1440
3    2070
dtype: int64

In [15]:
ages.div(marks)

0    0.333333
1    0.271429
2    0.225000
3    0.255556
dtype: float64

In [14]:
# we can also give index  by our choice 
ages = pd.Series([20,19,18,23.5], index=['maya', 'm2', 'm3', 'm4'])
ages

maya    20.0
m2      19.0
m3      18.0
m4      23.5
dtype: float64

In [15]:
ages['maya']

20.0

In [18]:
import numpy as np
marks = pd.Series(np.array([60,70,80,90]), index=np.arange(0,10,3))
marks

0    60
3    70
6    80
9    90
dtype: int64

In [18]:
# accessing element by lable index

In [19]:
ages[3]

23.5

In [20]:
marks[3]

70

In [21]:
# creating pandas series from dictionary 
name_age_dict = {'Prashant':20,'Adesh':19,'Ramesh':18,'Kiran':23}
name_age_dict

{'Prashant': 20, 'Adesh': 19, 'Ramesh': 18, 'Kiran': 23}

In [22]:
# here key become row index and value become value corresponding to row index 
dict_ser = pd.Series(name_age_dict)
dict_ser

Prashant    20
Adesh       19
Ramesh      18
Kiran       23
dtype: int64

### 2) Pandas DataFrame

####  It is two-dimensional data structure i.e. it is in tabular form containing rows and columns .

In [23]:
# creating Dataframe

In [24]:
# we can creat a Dataframe from csv file , exel file , list , dictionary , serieses , etc .

In [23]:
# using list
name=['Prashant','Adesh','Ramesh','Kiran']

# pd.Series

df = pd.DataFrame(name)
df

          0
0  Prashant
1     Adesh
2    Ramesh
3     Kiran

In [26]:
# using list of lists
data = [['Mayur','70','A'],['Vrushali','75','A+'],['Atul','80','O'],['Dadaraje','85','O']]

df = pd.DataFrame(data , columns = ('Name','Marks','Grade'))
df

       Name Marks Grade
0     Mayur    70     A
1  Vrushali    75    A+
2      Atul    80     O
3  Dadaraje    85     O

In [27]:
pd.DataFrame()

Empty DataFrame
Columns: []
Index: []

In [29]:
name=['Prashant','Adesh','Ramesh','Kiran']
age= [20,19,18,23]

In [31]:
# using dictionary
dict1 = { 'name': name, 'age' : age }
df = pd.DataFrame(dict1)
df

       name  age
0  Prashant   20
1     Adesh   19
2    Ramesh   18
3     Kiran   23

In [33]:
# using list of dictionaries 
data = [       {'Prashant':20,'Adesh':19,'Ramesh':18,'Kiran':23}     ,     {'Prashant':60,'Adesh':70,'Ramesh':80,'Kiran':90}    ]

df = pd.DataFrame(data)
df

   Prashant  Adesh  Ramesh  Kiran
0        20     19      18     23
1        60     70      80     90

In [30]:
# using pandas series 

# create name pd series
name=['Prashant','Adesh','Ramesh','Kiran']
name_ser = pd.Series(name)

# create age pd series
age = [18,20,22,24]
age_ser = pd.Series(age)

# created dict of pd series
name_age = {'Name':name_ser,'Age':age_ser}

# convert dict of pd series into dataframe
df = pd.DataFrame(name_age)
df

       Name  Age
0  Prashant   18
1     Adesh   20
2    Ramesh   22
3     Kiran   24

## operations on dataframe

In [31]:
# deleting of rows 
df = df.drop(1)
df

       Name  Age
0  Prashant   18
2    Ramesh   22
3     Kiran   24

In [32]:
# we can add two Dataframes having same length 
age = [18,20,22,24]
df_age = pd.DataFrame(age)
df_age

    0
0  18
1  20
2  22
3  24

In [33]:
mark = [60,65,70,75]
df_mark = pd.DataFrame(mark)
print(df_mark)

    0
0  60
1  65
2  70
3  75

In [34]:
# row wise
df = df_age.append(df_mark, ignore_index=True)
df

    0
0  18
1  20
2  22
3  24
4  60
5  65
6  70
7  75

In [35]:
# now we will see some in built functions of Dataframe for this we creat dataframe of numbers using random distribution

In [36]:
df = pd.DataFrame(np.random.randn(5,3),columns = ['col_1','col_2','col_3'])
df

      col_1     col_2     col_3
0 -0.358232  0.091680  0.508623
1 -1.235780  0.614637 -0.079831
2  0.456627  0.537844  1.512931
3 -0.320785  0.210815  0.124797
4 -0.803740 -1.442720 -0.405728

In [37]:
# columnwise sum
df.sum(0)

col_1   -2.261908
col_2    0.012257
col_3    1.660792
dtype: float64

In [38]:
# rowwise sum
df.sum(1)

0    0.242071
1   -0.700974
2    2.507403
3    0.014828
4   -2.652187
dtype: float64

In [39]:
# column wise average
df.mean()

col_1   -0.452382
col_2    0.002451
col_3    0.332158
dtype: float64

In [40]:
# we can also get direct descriptive statistics 
df.describe()

          col_1     col_2     col_3
count  5.000000  5.000000  5.000000
mean  -0.452382  0.002451  0.332158
std    0.630406  0.836856  0.738677
min   -1.235780 -1.442720 -0.405728
25%   -0.803740  0.091680 -0.079831
50%   -0.358232  0.210815  0.124797
75%   -0.320785  0.537844  0.508623
max    0.456627  0.614637  1.512931

In [41]:
# now will see how to creat Dataframe using csv file

df = pd.read_csv("cars.csv")
df

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8,307.0,130,3504,12.0,70,US
1,Buick Skylark 320,15.0,8,350.0,165,3693,11.5,70,US
2,Plymouth Satellite,18.0,8,318.0,150,3436,11.0,70,US
3,AMC Rebel SST,16.0,8,304.0,150,3433,12.0,70,US
4,Ford Torino,17.0,8,302.0,140,3449,10.5,70,US
...,...,...,...,...,...,...,...,...,...
401,Ford Mustang GL,27.0,4,140.0,86,2790,15.6,82,US
402,Volkswagen Pickup,44.0,4,97.0,52,2130,24.6,82,Europe
403,Dodge Rampage,32.0,4,135.0,84,2295,11.6,82,US
404,Ford Ranger,28.0,4,120.0,79,2625,18.6,82,US
405,Chevy S-10,31.0,4,119.0,82,2720,19.4,82,US

In [42]:
type(df)

pandas.core.frame.DataFrame

In [43]:
# now we will see how to creat data frame from xls file
df = pd.read_excel("cars.xls")
df.head()

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8,307.0,130,3504,12.0,70,US
1,Buick Skylark 320,15.0,8,350.0,165,3693,11.5,70,US
2,Plymouth Satellite,18.0,8,318.0,150,3436,11.0,70,US
3,AMC Rebel SST,16.0,8,304.0,150,3433,12.0,70,US
4,Ford Torino,17.0,8,302.0,140,3449,10.5,70,US

In [44]:
type(df)

pandas.core.frame.DataFrame

In [45]:
# to get first 5 records 
df.head()

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8,307.0,130,3504,12.0,70,US
1,Buick Skylark 320,15.0,8,350.0,165,3693,11.5,70,US
2,Plymouth Satellite,18.0,8,318.0,150,3436,11.0,70,US
3,AMC Rebel SST,16.0,8,304.0,150,3433,12.0,70,US
4,Ford Torino,17.0,8,302.0,140,3449,10.5,70,US

In [46]:
# to get first 10 records 
df.head(4)

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8,307.0,130,3504,12.0,70,US
1,Buick Skylark 320,15.0,8,350.0,165,3693,11.5,70,US
2,Plymouth Satellite,18.0,8,318.0,150,3436,11.0,70,US
3,AMC Rebel SST,16.0,8,304.0,150,3433,12.0,70,US

In [47]:
# to get last 5 records 
df.tail()

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
401,Ford Mustang GL,27.0,4,140.0,86,2790,15.6,82,US
402,Volkswagen Pickup,44.0,4,97.0,52,2130,24.6,82,Europe
403,Dodge Rampage,32.0,4,135.0,84,2295,11.6,82,US
404,Ford Ranger,28.0,4,120.0,79,2625,18.6,82,US
405,Chevy S-10,31.0,4,119.0,82,2720,19.4,82,US

In [48]:
# to get last 10 records 
df.tail(3)

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
403,Dodge Rampage,32.0,4,135.0,84,2295,11.6,82,US
404,Ford Ranger,28.0,4,120.0,79,2625,18.6,82,US
405,Chevy S-10,31.0,4,119.0,82,2720,19.4,82,US

In [49]:
# for veiwing No of columns and rows in dataframe 
df.shape

(406, 9)

In [50]:
# to get summary of the columns i.e to get how many non null values are present in each column also gives data type
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 406 entries, 0 to 405
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Car           406 non-null    object
 1   MPG           406 non-null    float64
 2   Cylinders     406 non-null    int64
 3   Displacement  406 non-null    float64
 4   Horsepower    406 non-null    int64
 5   Weight        406 non-null    int64
 6   Acceleration  406 non-null    float64
 7   Model         406 non-null    int64
 8   Origin        406 non-null    object
dtypes: float64(3), int64(4), object(2)
memory usage: 28.7+ KB